app/Controllers/Dashboard.php

    public function index()
    {
        $this->autoBatalSewa();
        $session = session();
        $data['title'] = 'Dashboard';
        $data['menu'] = 'mn_dashboard';
        $data['kamar'] = $this->kamarModel->where('is_active', 'y')->findAll();
---
SELECT *
FROM `kamar`
WHERE `is_active` = 'y'