app/Controllers/Front_controller.php

    public function index()
    {
        $session = session();
        $data['title'] = 'Dashboard';
        $data['menu'] = 'mn_dashboard';
        $data['kamar'] = $this->kamarModel->where('is_active', 'y')->findAll();
---
SELECT *
FROM `kamar`
WHERE `is_active` = 'y'

    public function sewa_kamar()
    {
        if (!$this->session->has('id_penyewa')) {
            return redirect()->to('/Front-Dashboard');
        }
        $data['title'] = 'Sewa Kamar';
        $data['menu'] = 'mn_sewa_kamar';
        $data['kamar'] = $this->kamarModel->where('is_active', 'y')->findAll();
---
SELECT *
FROM `kamar`
WHERE `is_active` = 'y'

    public function save_sewa_kamar()
    {
        $id_penyewa = $this->request->getPost('id_penyewa');
        $id_kamar = $this->request->getPost('id_kamar');
        $tanggal_masuk = $this->request->getPost('tanggal_masuk');
        $tanggal_keluar = $this->request->getPost('tanggal_keluar');
        $lama_sewa = $this->request->getPost('lama_sewa');
        $harga = $this->request->getPost('harga');
        $total_harga = $lama_sewa * $harga;
        $status_pembayaran = 'Menunggu pembayaran';
        $status = '-';
        $data = [
            'id_penyewa'      => $id_penyewa,
            'id_kamar'        => $id_kamar,
            'tanggal_masuk'   => $tanggal_masuk,
            'tanggal_keluar'  => $tanggal_keluar,
            'lama_sewa'       => $lama_sewa,
            'total_harga'     => $total_harga,
            'status'          => $status,
            'status_pembayaran' => $status_pembayaran
        ];

        if ($this->sewaKamarModel->save($data)) {
---
INSERT INTO `sewa_kamar` (`id_penyewa`, `id_kamar`, `tanggal_masuk`, `tanggal_keluar`, `lama_sewa`, `total_harga`, `status`, `status_pembayaran`) VALUES ('2', '3', '2025-07-03', '2025-07-04', '1', 500000, '-', 'Menunggu pembayaran')

    public function save_pembayaran()
    {
        $id_sewa_kamar = $this->request->getPost('id_sewa');
        $jenis_pembayaran = 'DP';
        $metode_pembayaran = $this->request->getPost('metode_pembayaran');
        $jumlah = $this->request->getPost('jumlah_pembayaran');
        $id_kamar = $this->request->getPost('id_kamar');
        $sewaKamar = $this->sewaKamarModel->find($id_sewa_kamar);
---
SELECT *
FROM `sewa_kamar`
WHERE `sewa_kamar`.`id` = '4'

            'bukti' => $namaFoto,
            'created_at' => date('Y-m-d H:i:s')
        ];
        $this->pembayaranModel->insert($dataPembayaran);
---
INSERT INTO `pembayaran` (`id_sewa_kamar`, `tanggal_pembayaran`, `jenis_pembayaran`, `metode_pembayaran`, `jumlah`, `bukti`, `created_at`) VALUES ('4', '2025-07-03', 'DP', 'Transfer', '250000', '1751530444_f45a554c613ce31dd59d.jpeg', '2025-07-03 08:14:04')

            'status_pembayaran' => 'Sudah bayar DP',
            'status' => 'Booked'
        ];
        $this->sewaKamarModel->update($id_sewa_kamar, $dataSewa);
---
UPDATE `sewa_kamar` SET `status_pembayaran` = 'Sudah bayar DP', `status` = 'Booked'
WHERE `sewa_kamar`.`id` IN ('4')

        $dataKamar = [
            'status' => 'Dipesan'
        ];
        $this->kamarModel->update($id_kamar, $dataKamar);
---
UPDATE `kamar` SET `status` = 'Dipesan'
WHERE `kamar`.`id` IN ('3')