app/Controllers/Kamar_controller.php

    public function index()
    {
        $data['title'] = "Data kamar";
        $data['menu'] = "mn_kamar";
        $data['data'] = $this->kamarModel->where('is_active', 'y')->findAll();
---
SELECT *
FROM `kamar`
WHERE `is_active` = 'y'