app/Controllers/Laporan_controller.php

    public function laporan_penyewa()
    {
        $data['title'] = "Laporan Data Penyewa";
        $data['data'] = $this->penyewaModel->where('is_active', 'y')->findAll();
---
SELECT *
FROM `penyewa`
WHERE `is_active` = 'y'

    public function laporan_kamar()
    {
        $data['title'] = "Laporan Data Kamar";
        $data['data'] = $this->kamarModel->where('is_active', 'y')->findAll();
---
SELECT *
FROM `kamar`
WHERE `is_active` = 'y'