app/Controllers/Login_controller.php

SELECT *
FROM `user`
WHERE `username` = 'admin'
 LIMIT 1
---
    function login()
    {
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $user = $this->userModel->where('username', $username)->first();