app/Controllers/Penyewa_controller.php

SELECT *
FROM `penyewa`
WHERE `is_active` = 'y'
---
    public function index()
    {
        $data['title'] = "Data Penyewa";
        $data['menu'] = "mn_penyewa";
        $data['data'] = $this->penyewaModel->where('is_active', 'y')->findAll();