app/Controllers/Sewa_kamar_controller.php

    public function index()
    {
        $data['title'] = "Data Sewa Kamar";
        $data['menu'] = "mn_sewa_kamar";
        $data['kamar'] = $this->kamarModel->where('is_active', 'y')->findAll();
        $data['total_kamar'] = count($data['kamar']);
        $data['total_kamar_kosong'] = count(array_filter($data['kamar'], function ($kamar) {
            return $kamar->status == 'Kosong';
        }));
        $data['total_kamar_terisi'] = count(array_filter($data['kamar'], function ($kamar) {
            return $kamar->status == 'Terisi';
        }));
        $data['total_kamar_dipesan'] = count(array_filter($data['kamar'], function ($kamar) {
            return $kamar->status == 'Dipesan';
        }));
        $data['penyewa'] = $this->penyewaModel->where('is_active', 'y')->findAll();
---
SELECT *
FROM `kamar`
WHERE `is_active` = 'y'
SELECT *
FROM `penyewa`
WHERE `is_active` = 'y'

    public function cetak_struk($id = null)
    {
        $dataSewa = $this->sewaKamarModel->first($id);
        $dataPenyewa = $this->penyewaModel->find($dataSewa->id_penyewa);
        $dataKamar = $this->kamarModel->find($dataSewa->id_kamar);
        $dataPembayaran = $this->pembayaranModel->where('id_sewa_kamar', $dataSewa->id)->first();
---
SELECT *
FROM `sewa_kamar`
 LIMIT 1
SELECT *
FROM `penyewa`
WHERE `penyewa`.`id` = '1'
SELECT *
FROM `kamar`
WHERE `kamar`.`id` = '1'
SELECT *
FROM `pembayaran`
WHERE `id_sewa_kamar` = '1'
 LIMIT 1