app/Models/Sewa_kamar_model.php

    public function getListData()
    {
        return $this->select('sewa_kamar.*, penyewa.nama_penyewa,penyewa.nik, kamar.nama_kamar')
            ->join('penyewa', 'penyewa.id = sewa_kamar.id_penyewa')
            ->join('kamar', 'kamar.id = sewa_kamar.id_kamar')
            ->findAll();
---
SELECT `sewa_kamar`.*, `penyewa`.`nama_penyewa`, `penyewa`.`nik`, `kamar`.`nama_kamar`
FROM `sewa_kamar`
JOIN `penyewa` ON `penyewa`.`id` = `sewa_kamar`.`id_penyewa`
JOIN `kamar` ON `kamar`.`id` = `sewa_kamar`.`id_kamar`

    public function getListDatabyPenyewa($id_penyewa)
    {
        return $this->select('sewa_kamar.*, penyewa.nama_penyewa, penyewa.nik, kamar.nama_kamar')
            ->join('penyewa', 'penyewa.id = sewa_kamar.id_penyewa')
            ->join('kamar', 'kamar.id = sewa_kamar.id_kamar')
            ->where('sewa_kamar.id_penyewa', $id_penyewa)
            ->findAll();
---
SELECT `sewa_kamar`.*, `penyewa`.`nama_penyewa`, `penyewa`.`nik`, `kamar`.`nama_kamar`
FROM `sewa_kamar`
JOIN `penyewa` ON `penyewa`.`id` = `sewa_kamar`.`id_penyewa`
JOIN `kamar` ON `kamar`.`id` = `sewa_kamar`.`id_kamar`
WHERE `sewa_kamar`.`id_penyewa` = '2'

    public function get_lap_sewa_kamar($tgl_awal, $tgl_akhir)
    {
        return $this->select('sewa_kamar.*, penyewa.nama_penyewa, penyewa.nik, kamar.nama_kamar')
            ->join('penyewa', 'penyewa.id = sewa_kamar.id_penyewa')
            ->join('kamar', 'kamar.id = sewa_kamar.id_kamar')
            ->where('sewa_kamar.tanggal_masuk >=', $tgl_awal)
            ->where('sewa_kamar.tanggal_masuk <=', $tgl_akhir)
            ->findAll();
---
SELECT `sewa_kamar`.*, `penyewa`.`nama_penyewa`, `penyewa`.`nik`, `kamar`.`nama_kamar`
FROM `sewa_kamar`
JOIN `penyewa` ON `penyewa`.`id` = `sewa_kamar`.`id_penyewa`
JOIN `kamar` ON `kamar`.`id` = `sewa_kamar`.`id_kamar`
WHERE `sewa_kamar`.`tanggal_masuk` >= '2025-07-01'
AND `sewa_kamar`.`tanggal_masuk` <= '2025-07-31'