app/Models/User_model.php

SELECT *, `user`.`id` as `id_user`, `role`.`role_name` as `nama_role`, `user`.`role` as `role`
FROM `user`
LEFT JOIN `role` ON `role`.`id`=`user`.`role`
WHERE `user`.`id` = '1'
---
    public function getById($id)
    {
        $builder = $this->db->table('user');
        $builder->select('*,user.id as id_user,role.role_name as nama_role,user.role as role');
        $builder->join('role', 'role.id=user.role', 'left');
        $builder->where('user.id', $id);
        return $builder->get();